<?php

use yii\db\Migration;

class m200426_104646_add_location_regions extends Migration
{
    public function safeUp()
    {
        $regions = [
            [3160, 'Алтайский край'],
            [3223, 'Амурская область'],
            [3251, 'Архангельская область'],
            [3282, 'Астраханская область'],
            [3296, 'Башкортостан[Башкирия]'],
            [3352, 'Белгородская область'],
            [3371, 'Брянская область'],
            [3407, 'Бурятия'],
            [3437, 'Владимирская область'],
            [3468, 'Волгоградская область'],
            [3503, 'Вологодская область'],
            [3529, 'Воронежская область'],
            [3563, 'Нижегородская [Горьковская]'],
            [3630, 'Дагестан'],
            [3673, 'Еврейская область'],
            [3675, 'Ивановская область'],
            [3703, 'Иркутская область'],
            [3751, 'Кабардино-Балкария'],
            [3761, 'Калининградская область'],
            [3784, 'Тверская область'],
            [3827, 'Калмыкия'],
            [3841, 'Калужская область'],
            [3872, 'Камчатская область'],
            [3892, 'Карелия'],
            [3921, 'Кемеровская область'],
            [3952, 'Кировская область'],
            [3994, 'Коми'],
            [4026, 'Костромская область'],
            [4052, 'Краснодарский край'],
            [4105, 'Красноярский край'],
            [4176, 'Курганская область'],
            [4198, 'Курская область'],
            [4227, 'Липецкая область'],
            [4243, 'Магаданская область'],
            [4270, 'Марий Эл'],
            [4287, 'Мордовия'],
            [4312, 'Москва и Московская область'],
            [4481, 'Мурманская область'],
            [4503, 'Новгородская область'],
            [4528, 'Новосибирская область'],
            [4561, 'Омская область'],
            [4593, 'Оренбургская область'],
            [4633, 'Орловская область'],
            [4657, 'Пензенская область'],
            [4689, 'Пермская область'],
            [4734, 'Приморский край'],
            [4773, 'Псковская область'],
            [4800, 'Ростовская область'],
            [4861, 'Рязанская область'],
            [4891, 'Самарская область'],
            [4925, 'Санкт-Петербург и область'],
            [4969, 'Саратовская область'],
            [5011, 'Саха [Якутия]'],
            [5052, 'Сахалин'],
            [5080, 'Свердловская область'],
            [5151, 'Северная Осетия'],
            [5161, 'Смоленская область'],
            [5191, 'Ставропольский край'],
            [5225, 'Тамбовская область'],
            [5246, 'Татарстан'],
            [5291, 'Томская область'],
            [5312, 'Тува [Тувинская Респ.]'],
            [5326, 'Тульская область'],
            [5356, 'Тюменская область'],
            [5404, 'Удмуртия'],
            [5432, 'Ульяновская область'],
            [5458, 'Уральская область'],
            [5473, 'Хабаровский край'],
            [5507, 'Челябинская область'],
            [5543, 'Чеченская республика'],
            [5555, 'Читинская область'],
            [5600, 'Чувашия'],
            [5625, 'Ярославская область'],
            [5626, 'Республика Ингушетия'],
        ];

        Yii::$app->db->createCommand()
            ->batchInsert(
                '{{%geo_regions}}',
                ['id', 'name'],
                $regions
            )->execute();
    }

    public function safeDown()
    {
        //$this->delete(m200420_164526_Locations::$table_region);
    }
}